#+TITLE: Emacs Config
#+PROPERTY: header-args :tangle yes

** Modeline stuff
#+begin_src emacs-lisp
(setq doom-modeline-major-mode-icon t)
(after! doom-modeline
  (remove-hook 'doom-modeline-mode-hook #'size-indication-mode) ; filesize in modeline
  (remove-hook 'doom-modeline-mode-hook #'column-number-mode)   ; cursor column in modeline
  (setq doom-modeline-buffer-encoding nil)
  (setq doom-modeline-buffer-file-name-style 'truncate-upto-root)
  (setq doom-modeline-enable-word-count t)
  (setq doom-modeline-continuous-word-count-modes '(markdown-mode gfm-mode org-mode latex-mode tex-mode text-mode))
  )
#+end_src

#+RESULTS:
| markdown-mode | gfm-mode | org-mode | latex-mode | tex-mode | text-mode |
** ergonomic keys
Based on ergoemacs key bindings, but adjusted for me
I want to have movement using Ctrl+something

#+begin_src emacs-lisp
(map!
 "C-x C-x" 'pop-to-mark-command
 "C-o" 'other-window
 "C-t" 'previous-line
 "C-p" 'transpose-chars
 "M-i" 'universal-argument
 "M-p" (lambda () (interactive) (execute-kbd-macro (kbd "M-{")))
 "M-g" (lambda () (interactive) (execute-kbd-macro (kbd "M-}")))
 "M-[" (lambda () (interactive) (execute-kbd-macro (kbd "M-{")))
 "M-]" (lambda () (interactive) (execute-kbd-macro (kbd "M-}")))
 "s-z" 'repeat
 "C-c m" 'counsel-describe-face
 "C-c q" 'switch-theme
 "M-;" 'comment-line
 )



(map! :map general-override-mode-map
      "C-." 'set-mark-command
      )

(define-key key-translation-map (kbd "C-u") (kbd "C-x"))
(define-key key-translation-map (kbd "M-h") (kbd "C-x C-s"))

#+end_src

#+RESULTS:
: 

** org capture
#+BEGIN_SRC emacs-lisp :tangle yes
(after! org
  (setq +org-capture-todo-file "~/notes/org/todo/inbox.org")

  (setq org-capture-templates
        '(("t" "Personal todo" entry
           (file+headline +org-capture-todo-file "Inbox")
           "* TODO %?\n%i\n%a" :prepend t))
        )
  )
#+END_SRC

#+RESULTS:
| t | Personal todo | entry | (file+headline +org-capture-todo-file Inbox) | * TODO %? |

** org agenda
#+BEGIN_SRC emacs-lisp
;; set priorities

(after! org
  (setq org-agenda-sticky t)
  (setq org-agenda-use-time-grid nil)
  (setq org-agenda-span 14)
     (setq org-log-done 'time)
  (setq org-priority-highest 0)
  (setq org-priority-lowest 9)
  (setq org-priority-default 3)

  (setq org-deadline-warning-days 7)

  (setq org-agenda-skip-deadline-prewarning-if-scheduled t)
  (setq org-scheduled-past-days 14)

  (setq org-todo-keywords
        '((sequence "TODO(t)" "STRT(s)" "PROJ(p)" "SCHD(c)" "WAIT(w)" "FUTR(f)"
                    "|"
                    "DONE(d)" "KILL(k)")))

  (setq org-agenda-breadcrumbs-separator "->")

  (with-no-warnings
    (custom-declare-face '+org-todo-future
                         '((t (:inherit (bold font-lock-keyword-face org-todo)))) ""))

  (setq org-todo-keyword-faces
        '(("STRT" . +org-todo-active)
          ("SCHD" . +org-todo-active)
          ("WAIT" . +org-todo-onhold)
          ("FUTR" . +org-todo-future)
          ("PROJ" . +org-todo-project)))

  (setq org-agenda-prefix-format " %i %?-12t% s")
  (setq org-agenda-overriding-header "⚡ SCHEDULE:\n")

  )

(setq org-agenda-custom-commands
      '(("o" "My Agenda"
         ((todo "TODO" (
                      (org-agenda-overriding-header "\nDo Today:\n⎺⎺⎺⎺⎺⎺⎺⎺⎺")
                      (org-agenda-remove-tags t)
                      (org-agenda-prefix-format " %-2i %-15b")
                      (org-agenda-todo-keyword-format "")
                       ))
          (agenda "" (
                      (org-agenda-start-day "+0d")
                      (org-agenda-span 5)
                      (org-agenda-overriding-header "Schedule:⎺⎺⎺⎺⎺⎺⎺⎺⎺")
                      (org-agenda-repeating-timestamp-show-all nil)
                      (org-agenda-remove-tags t)
                      (org-agenda-prefix-format   "  %-3i  %-15b %t%s")
                      (org-agenda-todo-keyword-format " ☐ ")
                      (org-agenda-current-time-string "⮜┈┈┈┈┈┈┈ now")
                      (org-agenda-scheduled-leaders '("" ""))
                      (org-agenda-time-grid (quote ((daily today remove-match)
                                                    (0900 1200 1500 1800 2100)
                                                    "      " "┈┈┈┈┈┈┈┈┈┈┈┈┈")))
                       ))
          ))))

#+END_SRC

#+RESULTS:
| o | My Agenda | ((todo TODO ((org-agenda-overriding-header |
** org-ql
#+BEGIN_SRC emacs-lisp
(after! org-ql
  (setq org-ql-views
        '(
          ("deadline" :buffers-files org-agenda-files
           :query
           (and (todo) (deadline))
           :sort deadline
           :super-groups ((:auto-category))
           :title "deadline")

          ("category" :buffers-files org-agenda-files
           :query
           (and (todo) (not (todo "WAIT" "HOLD"))
                (not (scheduled :from today))
                (not (children (todo))))
           :sort (priority) :narrow nil
           :super-groups ((:auto-category))
           :title "category")

          ("priority" :buffers-files org-agenda-files
           :query
           (and (todo) (not (todo "WAIT" "HOLD"))
                (not (scheduled :from today))
                (not (children (todo))))
           :sort nil :narrow nil :super-groups
           ((:auto-priority))
           :title "priority")
          ))
  )

#+END_SRC

#+RESULTS:
| deadline | :buffers-files | org-agenda-files | :query | (and (todo) (deadline))                                                                   | :sort | deadline   | :super-groups | ((:auto-category)) | :title        | deadline           |        |          |
| category | :buffers-files | org-agenda-files | :query | (and (todo) (not (todo WAIT HOLD)) (not (scheduled :from today)) (not (children (todo)))) | :sort | (priority) | :narrow       | nil                | :super-groups | ((:auto-category)) | :title | category |
| priority | :buffers-files | org-agenda-files | :query | (and (todo) (not (todo WAIT HOLD)) (not (scheduled :from today)) (not (children (todo)))) | :sort | nil        | :narrow       | nil                | :super-groups | ((:auto-priority)) | :title | priority |

** async execute
#+begin_src emacs-lisp :tangle yes
(after! org
  (require 'ob-async)
  (setq ob-async-no-async-languages-alist '(
                                            "jupyter-python" "jupyter-julia"
                                            "ipython"
                                            ))
  )
#+end_src

#+RESULTS:
| jupyter-python | jupyter-julia | ipython |
* abbrev mode
#+begin_src emacs-lisp :tangle yes
(use-package abbrev
  :init
  (setq-default abbrev-mode t)
  ;; a hook funtion that sets the abbrev-table to org-mode-abbrev-table
  ;; whenever the major mode is a text mode
  (defun tec/set-text-mode-abbrev-table ()
    (if (derived-mode-p 'text-mode)
        (setq local-abbrev-table org-mode-abbrev-table)))
  :commands abbrev-mode
  :hook
  (abbrev-mode . tec/set-text-mode-abbrev-table)
  :config
  (setq abbrev-file-name (expand-file-name "abbrev.el" doom-private-dir))
  (setq save-abbrevs 'silently))
#+end_src

#+RESULTS:
| tec/set-text-mode-abbrev-table |

* recentf
#+begin_src emacs-lisp :tangle yes
(use-package! recentf                    ; Save recently visited files
  :init (recentf-mode)
  :config
  (setq recentf-max-saved-items nil
        recentf-max-menu-items 400
        ;; Cleanup recent files only when Emacs is idle, but not when the mode
        ;; is enabled, because that unnecessarily slows down Emacs. My Emacs
        ;; idles often enough to have the recent files list clean up regularly
        recentf-auto-cleanup 'never ;; disable before we start recentf! If using Tramp a lot.
        recentf-exclude (list "/\\.git/.*\\'" ; Git contents
                              "/elpa/.*\\'" ; Package files
                              "/itsalltext/" ; It's all text temp files
                              )))

(defun save-list-no-message ()
  (interactive)
  (let ((inhibit-message t)) (recentf-save-list))
  )
(run-at-time "2 min" 120 'save-list-no-message)
#+end_src

#+RESULTS:
: [nil 24229 56965 927378 120 save-list-no-message nil nil 790000]

** ob-ipython
#+begin_src emacs-lisp :tangle no
(after! org
  (require 'ob-ipython)
  (map! :map ob-ipython-mode-map
        "M-." 'ob-ipython-inspect
        "C--" 'company-ob-ipython
        "<S-Return>" 'org-ctrl-c-ctrl-c
        )
  )
(after! company
  (add-to-list 'company-backends 'company-ob-ipython)
  )

(after! org
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((ipython . t)
     ))
  )

(after! python
(add-to-list 'python-shell-completion-native-disabled-interpreters "jupyter")
)



#+end_src

#+RESULTS:
| jupyter | pypy | Python |
** emacs-jupyter
#+begin_src emacs-lisp :tangle yes
(defun my-org-execute-and-next-block ()
  (interactive)
  (condition-case nil
      (org-babel-execute-src-block)
    (error nil))
  (org-next-block 1)
  )

(after! org
  (require 'ob-jupyter)
  (require 'ob-python)
  (require 'ox-ipynb)
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (julia . t)
     (python . t)
     (jupyter . t)))
  (map! :map org-mode-map
        "M-." 'jupyter-inspect-at-point
        "C-z" 'jupyter-org-interrupt-kernel
        "C-'" 'my-org-execute-and-next-block
        )

  (setq org-babel-default-header-args:jupyter-python '((:async . "yes")
                                                      (:session . "/jpy:localhost#8888:py")
                                                      (:kernel . "python3")))
  )
#+end_src

#+RESULTS:
: ((:async . yes) (:session . /jpy:localhost#8888:py) (:kernel . python3))

